burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_cau_aes.c
        cau_key_parameter_struct key_initpara;
        cau_iv_parameter_struct iv_initpara;
        __IO uint32_t counter = 0U;
        uint32_t busystatus = 0U;

        uint32_t ivaddr = (uint32_t)cau_parameter->iv;

        /* key structure initialization */
        cau_key_struct_para_init(&key_initpara);
        /* AES key structure parameter config */
        cau_aes_key_config(cau_parameter->key, cau_parameter->key_size, &key_initpara);
        /* key initialization */
        cau_key_init(&key_initpara);

        /* AES decryption */
        if(CAU_DECRYPT == cau_parameter->alg_dir){   
            /* flush the IN and OUT FIFOs */
            cau_fifo_flush();
            /* initialize the CAU peripheral */
            cau_init(CAU_DECRYPT, CAU_MODE_AES_KEY, CAU_SWAPPING_32BIT);

            /* enable the CAU peripheral */
            cau_enable();

            /* wait until the busy flag is RESET */
            do{      
                busystatus = cau_flag_get(CAU_FLAG_BUSY);
                counter++;
            }while((AESBSY_TIMEOUT != counter) && (RESET != busystatus));

            if(RESET != busystatus){
                ret = ERROR;
            }
        }
        
        /* initialize the CAU peripheral */
        cau_init(cau_parameter->alg_dir, CAU_MODE_AES_CBC, CAU_SWAPPING_8BIT);
        
        /* vectors initialization */
        iv_initpara.iv_0_high = __REV(*(uint32_t*)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_0_low = __REV(*(uint32_t*)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_1_high = __REV(*(uint32_t*)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_1_low = __REV(*(uint32_t*)(ivaddr));
        cau_iv_init(&iv_initpara);

        /* flush the IN and OUT FIFOs */
        cau_fifo_flush();

        /* enable the CAU peripheral */
        cau_enable();

        /* AES calculate process */
        ret = cau_aes_calculate(cau_parameter->input, cau_parameter->in_length, output);

        /* disable the CAU peripheral */
        cau_disable();
    }
    return ret;
}

/*!
    \brief      encrypt and decrypt using AES in CTR mode (API_ID(0x001BU))
    \param[in]  cau_parameter: pointer to the input structure
                  alg_dir: algorithm dirctory
                    CAU_ENCRYPT, CAU_DECRYPT 
                  key: key (in bytes)
                  key_size: key size in bits, must be either 128, 192 or 256
                  iv: initialization vector, 16 bytes (in bytes)
                  input: input data (in bytes)
                  in_length: input data length in bytes, must be a multiple of 16 bytes
    \param[out] output: pointer to the returned buffer
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus cau_aes_ctr(cau_parameter_struct *cau_parameter, uint8_t *output)
{
    ErrStatus ret = ERROR;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cau_parameter)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001BU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(output)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001BU), ERR_PARAM_POINTER);
    } else
#endif
    {
        cau_key_parameter_struct key_initpara;
        cau_iv_parameter_struct iv_initpara;       
        uint32_t ivaddr = (uint32_t)cau_parameter->iv;

        /* key structure initialization */
        cau_key_struct_para_init(&key_initpara);
        /* initialize the CAU peripheral */
        cau_init(cau_parameter->alg_dir, CAU_MODE_AES_CTR, CAU_SWAPPING_8BIT);  

        /* AES key structure parameter config */
        cau_aes_key_config(cau_parameter->key, cau_parameter->key_size, &key_initpara);
        /* key initialization */
        cau_key_init(&key_initpara);

        /* vectors initialization */
        iv_initpara.iv_0_high = __REV(*(uint32_t*)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_0_low = __REV(*(uint32_t*)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_1_high = __REV(*(uint32_t*)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_1_low = __REV(*(uint32_t*)(ivaddr));
        cau_iv_init(&iv_initpara);

        /* flush the IN and OUT FIFOs */
        cau_fifo_flush();

        /* enable the CAU peripheral */
        cau_enable();

        /* AES calculate process */
        ret = cau_aes_calculate(cau_parameter->input, cau_parameter->in_length, output);

        /* disable the CAU peripheral */
        cau_disable();

    }
    return ret;
}

/*!
    \brief      encrypt and decrypt using AES in CFB mode (API_ID(0x001CU))
    \param[in]  cau_parameter: pointer to the input structure
                  alg_dir: algorithm dirctory
                    CAU_ENCRYPT, CAU_DECRYPT 
                  key: key (in bytes)
                  key_size: key size in bits, must be either 128, 192 or 256
                  iv: initialization vector, 16 bytes (in bytes)
                  input: input data (in bytes)
                  in_length: input data length in bytes, must be a multiple of 16 bytes
    \param[out] output: pointer to the returned buffer
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus cau_aes_cfb(cau_parameter_struct *cau_parameter, uint8_t *output)
{
    ErrStatus ret = ERROR;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cau_parameter)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001CU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(output)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001CU), ERR_PARAM_POINTER);
    } else
#endif
    {
        cau_key_parameter_struct key_initpara;
        cau_iv_parameter_struct iv_initpara;        
        uint32_t ivaddr = (uint32_t)cau_parameter->iv;

        /* key structure initialization */
        cau_key_struct_para_init(&key_initpara);
        /* initialize the CAU peripheral */
        cau_init(cau_parameter->alg_dir, CAU_MODE_AES_CFB, CAU_SWAPPING_8BIT);  

        /* AES key structure parameter config */
        cau_aes_key_config(cau_parameter->key, cau_parameter->key_size, &key_initpara);
        /* key initialization */
        cau_key_init(&key_initpara);

        /* vectors initialization */
        iv_initpara.iv_0_high = __REV(*(uint32_t*)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_0_low = __REV(*(uint32_t*)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_1_high = __REV(*(uint32_t*)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_1_low = __REV(*(uint32_t*)(ivaddr));
        cau_iv_init(&iv_initpara);

        /* flush the IN and OUT FIFOs */
        cau_fifo_flush();
        /* enable the CAU peripheral */
        cau_enable();

