burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_cau_aes.c
        /* AES calculate process */
        ret = cau_aes_calculate(cau_parameter->input, cau_parameter->in_length, output);

        /* disable the CAU peripheral */
        cau_disable();
    }
    return ret;
}

/*!
    \brief      encrypt and decrypt using AES in OFB mode (API_ID(0x001DU))
    \param[in]  cau_parameter: pointer to the input structure
                  alg_dir: algorithm dirctory
                    CAU_ENCRYPT, CAU_DECRYPT 
                  key: key (in bytes)
                  key_size: key size in bits, must be either 128, 192 or 256
                  iv: initialization vector, 16 bytes (in bytes)
                  input: input data (in bytes)
                  in_length: input data length in bytes, must be a multiple of 16 bytes
    \param[out] output: pointer to the returned buffer
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus cau_aes_ofb(cau_parameter_struct *cau_parameter, uint8_t *output)
{
    ErrStatus ret = ERROR;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cau_parameter)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001DU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(output)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001DU), ERR_PARAM_POINTER);
    } else
#endif
    {
        cau_key_parameter_struct key_initpara;
        cau_iv_parameter_struct iv_initpara;        
        uint32_t ivaddr = (uint32_t)cau_parameter->iv;

        /* key structure initialization */
        cau_key_struct_para_init(&key_initpara);
        /* initialize the CAU peripheral */
        cau_init(cau_parameter->alg_dir, CAU_MODE_AES_OFB, CAU_SWAPPING_8BIT);  

        /* AES key structure parameter config */
        cau_aes_key_config(cau_parameter->key, cau_parameter->key_size, &key_initpara);
        /* key initialization */
        cau_key_init(&key_initpara);

        /* vectors initialization */
        iv_initpara.iv_0_high = __REV(*(uint32_t*)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_0_low = __REV(*(uint32_t*)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_1_high = __REV(*(uint32_t*)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_1_low = __REV(*(uint32_t*)(ivaddr));
        cau_iv_init(&iv_initpara);

        /* flush the IN and OUT FIFOs */
        cau_fifo_flush();
        /* enable the CAU peripheral */
        cau_enable();

        /* AES calculate process */
        ret = cau_aes_calculate(cau_parameter->input, cau_parameter->in_length, output);

        /* disable the CAU peripheral */
        cau_disable();

    }
    return ret;
}

/*!
    \brief      encrypt and decrypt using AES in GCM mode (API_ID(0x001EU))
    \param[in]  cau_parameter: pointer to the input structure
                  alg_dir: algorithm dirctory
                  CAU_ENCRYPT, CAU_DECRYPT
                  key: key
                  key_size: key size in bits, must be either 128, 192 or 256
                  iv: initialization vector, 16 bytes
                  input: input data
                  in_length: input data length in bytes, must be a multiple of 16 bytes
                  aad: additional authentication data
                  aad_size: aad size in bytes, must be a multiple of 16 bytes
    \param[out] output: pointer to the returned output data buffer
    \param[out] tag: pointer to the returned tag buffer
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus cau_aes_gcm(cau_parameter_struct *cau_parameter, uint8_t *output, uint8_t *tag)
{
    ErrStatus ret = SUCCESS;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cau_parameter)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001EU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(output)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001EU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(tag)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001EU), ERR_PARAM_POINTER);
    } else
#endif
    {
        cau_key_parameter_struct key_initpara;
        cau_iv_parameter_struct iv_initpara;
        uint64_t aadlength = (uint64_t)cau_parameter->aad_size * 8U;
        uint64_t inputlength = (uint64_t)cau_parameter->in_length * 8U;
        uint32_t ivaddr = (uint32_t)cau_parameter->iv;
        uint32_t tagaddr = (uint32_t)tag;

        /* key structure initialization */
        cau_key_struct_para_init(&key_initpara);
        /* initialize the CAU peripheral */
        cau_init(cau_parameter->alg_dir, CAU_MODE_AES_GCM, CAU_SWAPPING_8BIT);    /* AES key structure parameter config */
        cau_aes_key_config(cau_parameter->key, cau_parameter->key_size, &key_initpara);
        /* key initialization */
        cau_key_init(&key_initpara);

        /* vectors initialization */
        iv_initpara.iv_0_high = __REV(*(uint32_t *)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_0_low = __REV(*(uint32_t *)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_1_high = __REV(*(uint32_t *)(ivaddr));
        ivaddr += 4U;
        iv_initpara.iv_1_low = __REV(*(uint32_t *)(ivaddr));
        cau_iv_init(&iv_initpara);

        /*========================= prepare phase=========================*/
        /* select prepare phase */
        cau_phase_config(CAU_PREPARE_PHASE);
        /* enable the CAU peripheral */
        cau_enable();
        /* wait for CAUEN bit to be 0 */
        while(ENABLE == cau_enable_state_get()) {
        }

        /*========================= AAD phase=======================*/
        if((uint32_t)0U != cau_parameter->aad_size) {
            /* select aad phase */
            cau_phase_config(CAU_AAD_PHASE);
            /* flush the IN and OUT FIFOs */
            cau_fifo_flush();
            /* enable the CAU peripheral */
            cau_enable();

            ret &= cau_fill_data(cau_parameter->aad, cau_parameter->aad_size);

