burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_cau_aes.c
        }

        /* encrypt or dcrypt phase */
        if((uint32_t)0U != cau_parameter->in_length) {
            /* select encrypt or dcrypt phase */
            cau_phase_config(CAU_ENCRYPT_DECRYPT_PHASE);
            /* flush the IN and OUT FIFOs */
            cau_fifo_flush();
            /* enable the CAU peripheral */
            cau_enable();

            /* AES calculate process */
            ret &= cau_aes_calculate(cau_parameter->input, cau_parameter->in_length, output);

        }

        /* tag phase */
        /* select tag phase */
        cau_phase_config(CAU_TAG_PHASE);
        /* flush the IN and OUT FIFOs */
        cau_fifo_flush();
        /* enable the CAU peripheral */
        cau_enable();

        if(DISABLE == cau_enable_state_get()) {
            ret = ERROR;
        }

    #if defined (GD32F5HC)
        cau_data_write(((uint32_t)(aadlength >> 32U)));
        cau_data_write(((uint32_t)aadlength));
        cau_data_write(((uint32_t)(inputlength >> 32U)));
        cau_data_write(((uint32_t)inputlength));
    #else
        cau_data_write(__REV((uint32_t)(aadlength >> 32U)));
        cau_data_write(__REV((uint32_t)aadlength));
        cau_data_write(__REV((uint32_t)(inputlength >> 32U)));
        cau_data_write(__REV((uint32_t)inputlength));
    #endif
        /* wait until the ONE flag is set */
        while(RESET == cau_flag_get(CAU_FLAG_OUTFIFO_NO_EMPTY)) {
        }

        /* read the tag in the OUT FIFO */
        *(uint32_t *)(tagaddr) = cau_data_read();
        tagaddr += 4U;
        *(uint32_t *)(tagaddr) = cau_data_read();
        tagaddr += 4U;
        *(uint32_t *)(tagaddr) = cau_data_read();
        tagaddr += 4U;
        *(uint32_t *)(tagaddr) = cau_data_read();
        tagaddr += 4U;

        /* disable the CAU peripheral */
        cau_disable();
    }
    return ret;
}

/*!
    \brief      encrypt and decrypt using AES in CCM mode (API_ID(0x001FU))
    \param[in]  cau_parameter: pointer to the input structure
                  alg_dir: algorithm dirctory
                    CAU_ENCRYPT, CAU_DECRYPT
                  key: key
                  key_size: key size in bytes
                  iv: initialization vector
                  iv_size: iv size in bytes
                  input: input data
                  in_length: input data length in bytes
                  aad: additional authentication data
                  aad_size: aad size
    \param[in]  tag_size: tag size
    \param[out] output: pointer to the returned output data buffer
    \param[out] tag: pointer to the returned tag buffer
    \param[out] aad_buf: pointer to the user buffer used when formatting aad block
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus cau_aes_ccm(cau_parameter_struct *cau_parameter, uint8_t output[], uint8_t tag[], uint32_t tag_size, uint8_t aad_buf[])
{
    ErrStatus ret = SUCCESS;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(cau_parameter)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001FU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(output)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x001FU), ERR_PARAM_POINTER);
    } else
#endif
    {
        cau_key_parameter_struct key_initpara;
        cau_iv_parameter_struct iv_initpara;
        
        uint32_t inputsize = cau_parameter->in_length;
        uint32_t aadaddr = (uint32_t)cau_parameter->aad;
        uint32_t aadsize = cau_parameter->aad_size;
        uint32_t aad_block_size = 0U;
        uint32_t ivaddr = (uint32_t)cau_parameter->iv;
        uint32_t ivsize = cau_parameter->iv_size;
        uint32_t i = 0U, plen = 0U;
        uint32_t head_index = 0U;
        uint8_t blockb0[16U] = {0U};
        uint8_t counter[16U] = {0U};
        uint32_t ctraddr = (uint32_t)counter;
        uint32_t b0addr = (uint32_t)blockb0;
        uint32_t temp_tag[4U];

        /* formatting the aad block */
        if((uint32_t)0U != aadsize) {
            /* check that the aad length is lower than 2^16 - 2^8 = 65536 - 256 = 65280 */
            if(aadsize < 65280U) {
                aad_buf[head_index++] = (uint8_t)((aadsize >> 8U) & 0xFFU);
                aad_buf[head_index++] = (uint8_t)((aadsize) & 0xFFU);
                aad_block_size = aadsize + 2U;
            } else {
                /* aad is encoded as 0xFF || 0xFE || [aadsize]32, i.e., six octets */
                aad_buf[head_index++] = 0xFFU;
                aad_buf[head_index++] = 0xFEU;
                aad_buf[head_index++] = (uint8_t)((aadsize & 0xFF000000U) >> 24U);
                aad_buf[head_index++] = (uint8_t)((aadsize & 0x00FF0000U) >> 16U);
                aad_buf[head_index++] = (uint8_t)((aadsize & 0x0000FF00U) >> 8U);
                aad_buf[head_index++] = (uint8_t)(aadsize & 0x000000FFU);
                aad_block_size = aadsize + 6U;
            }
            /* copy the aad buffer in internal buffer "HBuffer" */
            for(i = 0U; i < aadsize; i++) {
                aad_buf[head_index++] = *(uint8_t *)((uint32_t)(aadaddr + i));
            }
            
            /* check if the aad block size is modulo 16 */
            if(0U != (aad_block_size % 16U)) {
                /* Padd the aad buffer with 0s till the HBuffer length is modulo 16 */
                for(i = aad_block_size; i <= ((aad_block_size / 16U) + 1U) * 16U; i++) {
                    aad_buf[i] = 0U;
                }
                /* set the aad size to modulo 16 */
                aad_block_size = ((aad_block_size / 16U) + 1U) * 16U;
            }
            /* set the pointer aadaddr to HBuffer */
            aadaddr = (uint32_t)aad_buf;
        }

        /* formatting the block B0 */
        if(0U != aadsize) {
            blockb0[0] = 0x40U;
        }
        /* flags byte */
        blockb0[0] |= (0U | (((((uint8_t) tag_size - 2U) / 2U) & 0x07U) << 3U) | (((uint8_t)(15U - ivsize) - 1U) & 0x07U));

        if(ivsize > MAX_CCM_IV_SIZE) {
            ret = ERROR;
        }

        for(i = 0U; i < ivsize; i++) {
            blockb0[i + 1U] = *(uint8_t *)((uint32_t)(ivaddr + i));
        }

