burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_cau_aes.c
        /* the byte length for payload length expressing, which plus the ivsize must equal to 15 bytes */
        plen = 15U - ivsize;
        /* if the byte length for payload length expressing is more than 4 bytes */
        if(plen > 4U) {
            /* pad the blockb0 after vectors, and before the last 4 bytes */
            for(; i < 11U; i++) {
                blockb0[i + 1U] = 0U;
            }
            blockb0[12U] = (uint8_t)((inputsize >> 24U) & 0xFFU);
            blockb0[13U] = (uint8_t)((inputsize >> 16U) & 0xFFU);
            blockb0[14U] = (uint8_t)((inputsize >> 8U) & 0xFFU);
            blockb0[15U] = (uint8_t)(inputsize & 0xFFU);
        } else {
            /* the payload length is expressed in plen bytes */
            for(; i < 15U; i++) {
                blockb0[i + 1U] = (uint8_t)((inputsize >> ((plen - 1U) * 8U)) & 0xFFU);
                plen--;
            }
        }

        /* formatting the initial counter */
        /* byte 0: bits 0-2 contain the same encoding of q as in B0 */
        counter[0] = blockb0[0] & BLOCK_B0_MASK;
        for(i = 1U; i < ivsize + 1U; i++) {
            counter[i] = blockb0[i];
        }
        /* set the LSB to 1 */
        counter[15] |= 0x01U;

        /* init phase */
        /* flush the IN and OUT FIFOs */
        cau_fifo_flush();
        /* clear CAUEN bit to ensure CAU is disable */
        cau_disable();

        /* select init phase */
        cau_phase_config(CAU_PREPARE_PHASE);    
        /* initialize the CAU peripheral */
        cau_init(cau_parameter->alg_dir, CAU_MODE_AES_CCM, CAU_SWAPPING_8BIT); 

        /* key structure initialization */
        cau_key_struct_para_init(&key_initpara);
        /* AES key structure parameter config */
        cau_aes_key_config(cau_parameter->key, cau_parameter->key_size, &key_initpara);
        /* key initialization */
        cau_key_init(&key_initpara);

        /* vectors initialization */
        iv_initpara.iv_0_high = __REV(*(uint32_t *)(ctraddr));
        ctraddr += 4U;
        iv_initpara.iv_0_low = __REV(*(uint32_t *)(ctraddr));
        ctraddr += 4U;
        iv_initpara.iv_1_high = __REV(*(uint32_t *)(ctraddr));
        ctraddr += 4U;
        iv_initpara.iv_1_low = __REV(*(uint32_t *)(ctraddr));
        cau_iv_init(&iv_initpara);

        /* enable the CAU peripheral */
        cau_enable();

    #if defined (GD32F5HC)
        /* write block B0 in the In FIFO */
        cau_data_write(__REV(*(uint32_t *)(b0addr)));
        b0addr += 4U;
        cau_data_write(__REV(*(uint32_t *)(b0addr)));
        b0addr += 4U;
        cau_data_write(__REV(*(uint32_t *)(b0addr)));
        b0addr += 4U;
        cau_data_write(__REV(*(uint32_t *)(b0addr)));
    #else
        /* write block B0 in the In FIFO */
        cau_data_write(*(uint32_t*)(b0addr));
        b0addr += 4U;
        cau_data_write(*(uint32_t*)(b0addr));
        b0addr += 4U;
        cau_data_write(*(uint32_t*)(b0addr));
        b0addr += 4U;
        cau_data_write(*(uint32_t*)(b0addr));
    #endif
        /* wait for CAUEN bit to be 0 */
        while(ENABLE == cau_enable_state_get()) {
        }

        /*========================= AAD phase=======================*/
        if((uint32_t)0U != aadsize) {
            /* select aad phase */
            cau_phase_config(CAU_AAD_PHASE);
            /* enable the CAU peripheral */
            cau_enable();

            ret &= cau_fill_data((uint8_t *)aadaddr, aad_block_size);

        }

        /*========================= encryption/decryption phase=======================*/
        inputsize = cau_parameter->in_length;

        if((uint32_t)0U != inputsize) {
            /* select encrypt or dcrypt phase */
            cau_phase_config(CAU_ENCRYPT_DECRYPT_PHASE);
            /* enable the CAU peripheral */
            cau_enable();

            /* AES calculate process */
            ret &= cau_aes_calculate(cau_parameter->input, cau_parameter->in_length, output);
            
        }

        /*========================= tag phase=======================*/
        /* select final phase */
        cau_phase_config(CAU_TAG_PHASE);
        /* enable the CAU peripheral */
        cau_enable();

        if(DISABLE == cau_enable_state_get()) {
            ret = ERROR;
        }

        ctraddr = (uint32_t)counter;

    #if defined (GD32F5HC)
        cau_data_write(__REV(*(uint32_t *)(ctraddr)));
        ctraddr += 4U;
        cau_data_write(__REV(*(uint32_t *)(ctraddr)));
        ctraddr += 4U;
        cau_data_write(__REV(*(uint32_t *)(ctraddr)));
        ctraddr += 4U;
    #else
        cau_data_write(*(uint32_t*)(ctraddr));
        ctraddr += 4U;
        cau_data_write(*(uint32_t*)(ctraddr));
        ctraddr += 4U;
        cau_data_write(*(uint32_t*)(ctraddr));
        ctraddr += 4U;
    #endif
        /* reset bit 0 (after 8-bit swap) is equivalent to reset bit 24 (before 8-bit swap) */
        cau_data_write(__REV(*(uint32_t *)(ctraddr) & 0xFEFFFFFFU));

        /* wait until the ONE flag is set */
        while(RESET == cau_flag_get(CAU_FLAG_OUTFIFO_NO_EMPTY)) {
        }

    #if defined (GD32F5HC)
        /* read the tag in the OUT FIFO */
        temp_tag[0] = cau_data_read();
        temp_tag[1] = cau_data_read();
        temp_tag[2] = cau_data_read();
        temp_tag[3] = cau_data_read();
    #else
        temp_tag[0U] = cau_data_read();
        temp_tag[1U] = cau_data_read();
        temp_tag[2U] = cau_data_read();
        temp_tag[3U] = cau_data_read();
    #endif
        /* disable the CAU peripheral */
        cau_disable();

        /* Copy temporary authentication TAG in user TAG buffer */
        for(i = 0U; i < tag_size; i++) {
            tag[i] = (uint8_t)(temp_tag[i / 4U] >> (8U * (i % 4U)));
        }
    }
    return ret;
}

/*!
    \brief      AES key structure parameter config (API_ID(0x0020U))
    \param[in]  key: key used for AES algorithm (in bytes)
    \param[in]  keysize: length of the key in bits, must be either 128, 192 or 256 
    \param[out] cau_key_initpara: key init parameter struct
                  key_0_high: key 0 high
                  key_0_low:  key 0 low
                  key_1_high: key 1 high
                  key_1_low:  key 1 low
                  key_2_high: key 2 high
                  key_2_low:  key 2 low
                  key_3_high: key 3 high
                  key_3_low:  key 3 low
    \retval     none
*/
static void cau_aes_key_config(uint8_t *key, uint32_t keysize, cau_key_parameter_struct* cau_key_initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(key)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x0020U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(cau_key_initpara)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x0020U), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t keyaddr = (uint32_t)key;
      
        switch(keysize){
        case 128:        
            cau_aes_keysize_config(CAU_KEYSIZE_128BIT);
            cau_key_initpara->key_2_high = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_2_low = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_3_high = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_3_low = __REV(*(uint32_t*)(keyaddr));
            break;
        case 192:
            cau_aes_keysize_config(CAU_KEYSIZE_192BIT);
            cau_key_initpara->key_1_high = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_1_low = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_2_high = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_2_low = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_3_high = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_3_low = __REV(*(uint32_t*)(keyaddr));
            break;
        case 256:
            cau_aes_keysize_config(CAU_KEYSIZE_256BIT);
            cau_key_initpara->key_0_high = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_0_low = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_1_high = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_1_low = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_2_high = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_2_low = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_3_high = __REV(*(uint32_t*)(keyaddr));
            keyaddr += 4U;
            cau_key_initpara->key_3_low = __REV(*(uint32_t*)(keyaddr));
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      fill data into data input register (API_ID(0x0021U))
    \param[in]  input: pointer to the input buffer (in bytes)    
    \param[in]  in_length: length of the input buffer in bytes, must be a multiple of 16 bytes    
    \retval     ErrStatus: SUCCESS or ERROR
*/
static ErrStatus cau_fill_data(uint8_t *input, uint32_t in_length)
{
    ErrStatus ret = SUCCESS;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(input)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x0021U), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t inputaddr  = (uint32_t)input;
        uint32_t i = 0U;
        __IO uint32_t counter = 0U;
        uint32_t busystatus = 0U;

