burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_cau_aes.c
        if(DISABLE == cau_enable_state_get()){
            ret = ERROR;
        }
            
        for(i = 0U; i < in_length; i += 16U){    
            /* wait until the IEM flag is set */
            while(RESET == cau_flag_get(CAU_FLAG_INFIFO_EMPTY)){
            }
    #if defined (GD32F5HC)
            if(i + BLOCK_DATA_SIZE > in_length) {
                /* the last block data number is less than 128bit */
                uint32_t block_data_temp[4] = {0U};

                /* fill the remaining bits with zero */
                memcpy(block_data_temp, (uint32_t *)inputaddr, in_length - i);
                inputaddr = (uint32_t)block_data_temp;

                /* if GCM encryption or CCM decryption, then configurate NBPILB bits in CTL register */
                if((CAU_CTL & CAU_CTL_GCM_CCMPH) == CAU_ENCRYPT_DECRYPT_PHASE) {
                    if((CAU_CTL & (CAU_CTL_ALGM | CAU_CTL_CAUDIR)) == (CAU_MODE_AES_GCM | CAU_ENCRYPT)) {
                        CAU_CTL |= CAU_PADDING_BYTES(i + BLOCK_DATA_SIZE - in_length);
                    } else if((CAU_CTL & (CAU_CTL_ALGM | CAU_CTL_CAUDIR)) == (CAU_MODE_AES_CCM | CAU_DECRYPT)) {
                        CAU_CTL |= CAU_PADDING_BYTES(i + BLOCK_DATA_SIZE - in_length);
                    } else {
                    }
                }
            }
    #endif
            /* write data to the IN FIFO */
            cau_data_write(*(uint32_t*)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t*)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t*)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t*)(inputaddr));
            inputaddr += 4U;      
        }
        /* wait until the complete message has been processed */
        counter = 0U;
        do{        
            busystatus = cau_flag_get(CAU_FLAG_BUSY);
            counter++;
        }while((AESBSY_TIMEOUT != counter) && (RESET != busystatus));  
       
        if(RESET != busystatus){       
            ret = ERROR;
        }
        
    }
    return ret;
}

/*!
    \brief      AES calculate process (API_ID(0x0022U))
    \param[in]  input: pointer to the input buffer     
    \param[in]  in_length: length of the input buffer in bytes, must be a multiple of 16 bytes  
    \param[out]  output: pointer to the returned buffer    
    \retval     ErrStatus: SUCCESS or ERROR
*/
static ErrStatus cau_aes_calculate(uint8_t *input, uint32_t in_length, uint8_t *output)
{
    ErrStatus ret = SUCCESS;
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(input)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x0022U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(output)) {
        fw_debug_report_err(CAU_MODULE_ID, API_ID(0x0022U), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t inputaddr  = (uint32_t)input;
        uint32_t outputaddr = (uint32_t)output;
        uint32_t i = 0U;
        __IO uint32_t counter = 0U;
        uint32_t busystatus = 0U;  

        /* the clock is not enabled or there is no embeded CAU peripheral */
        if(DISABLE == cau_enable_state_get()){     
            ret = ERROR;
        }

        for(i = 0U; i < in_length; i += 16U){ 
            /* wait until the IEM flag is set */
            while(RESET == cau_flag_get(CAU_FLAG_INFIFO_EMPTY)){
            }

    #if defined (GD32F5HC)
            /* check if the last input data block */
            if(i + BLOCK_DATA_SIZE > in_length) {
                /* the last block data number is less than 128bit */
                uint8_t block_data_temp[16] = {0};

                /* fill the remaining bits with zero */
                memcpy_data(block_data_temp, (uint8_t *)inputaddr, in_length - i);
                inputaddr = (uint32_t)block_data_temp;

                /* if GCM encryption or CCM decryption, then configurate NBPILB bits in CTL register */
                if((CAU_CTL & (CAU_CTL_ALGM | CAU_CTL_CAUDIR)) == (CAU_MODE_AES_GCM | CAU_ENCRYPT)) {
                    CAU_CTL |= CAU_PADDING_BYTES(i + BLOCK_DATA_SIZE - in_length);
                } else if((CAU_CTL & (CAU_CTL_ALGM | CAU_CTL_CAUDIR)) == (CAU_MODE_AES_CCM | CAU_DECRYPT)) {
                    CAU_CTL |= CAU_PADDING_BYTES(i + BLOCK_DATA_SIZE - in_length);
                } else {
                }
            }
    #endif

            /* write data to the IN FIFO */
            cau_data_write(*(uint32_t*)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t*)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t*)(inputaddr));
            inputaddr += 4U;
            cau_data_write(*(uint32_t*)(inputaddr));
            inputaddr += 4U;

            /* wait until the complete message has been processed */
            counter = 0U;
            do{        
                busystatus = cau_flag_get(CAU_FLAG_BUSY);
                counter++;
            }while((AESBSY_TIMEOUT != counter) && (RESET != busystatus));

            if(RESET != busystatus){       
                ret = ERROR;
            }else{
                /* wait until the ONE flag is set */
                while(RESET == cau_flag_get(CAU_FLAG_OUTFIFO_NO_EMPTY)){
                }

                /* read the output block from the output FIFO */
                *(uint32_t*)(outputaddr) = cau_data_read();
                outputaddr += 4U;
                *(uint32_t*)(outputaddr) = cau_data_read();
                outputaddr += 4U;
                *(uint32_t*)(outputaddr) = cau_data_read();
                outputaddr += 4U;
                *(uint32_t*)(outputaddr) = cau_data_read();
                outputaddr += 4U;
            }
        }
    } 
    return ret;
}